Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t
Struct for the toleration event data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.PointsOnLineArraySize
The constant size of the Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.PointsOnLine array.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.PointsOnFaceArraySize
The constant size of the Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.PointsOnFace array.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.SnappedPointsArraySize
The constant size of the Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.SnappedPoints array.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.CursorEventData
The cursor data of the event.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.PointsOnLineCount
The number of tolerated points on line.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.PointsOnLine
The array containing tolerated points on line.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.PointsOnFaceCount
The number of tolerated faces.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.PointsOnFace
The array containing tolerated faces.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.SnappedPointsCount
The number of possible snapped points.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.SnappedPoints
The snapped point.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.TabulatorCount
The number of times the user has pushed the tabulator.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.TolerationPlane
The plane that a snapped point is dropped to